JohnHau/mis/coap_server_example_for_STM32f407_Discovery/Inc/stm32f4xx_hal_conf.h
/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the 
  *        HAL drivers code
  */
/* #define USE_FULL_ASSERT    1 */

/* ################## Ethernet peripheral configuration ##################### */
/* Section 1 : Ethernet peripheral configuration */

 /* MAC ADDRESS: MAC_ADDR0:MAC_ADDR1:MAC_ADDR2:MAC_ADDR3:MAC_ADDR4:MAC_ADDR5 */
 #define MAC_ADDR0   2U
 #define MAC_ADDR1   0U
 #define MAC_ADDR2   0U
 #define MAC_ADDR3   0U
 #define MAC_ADDR4   0U
 #define MAC_ADDR5   0U

 /* Definition of the Ethernet driver buffers size and count */
 #define ETH_RX_BUF_SIZE                ETH_MAX_PACKET_SIZE /* buffer size for receive               */
 #define ETH_TX_BUF_SIZE                ETH_MAX_PACKET_SIZE /* buffer size for transmit              */
 #define ETH_RXBUFNB                    ((uint32_t)5U)       /* 4 Rx buffers of size ETH_RX_BUF_SIZE  */
 #define ETH_TXBUFNB                    ((uint32_t)5U)       /* 4 Tx buffers of size ETH_TX_BUF_SIZE  */

 /* Section 2: PHY configuration section */

 /* PHY Reset delay */
 //#define PHY_RESET_DELAY    ((uint32_t)0x000FFFFF)
 /* PHY Configuration delay */
 //#define PHY_CONFIG_DELAY   ((uint32_t)0x00FFFFFF)

 /* The PHY status register value change from a PHY to another, so the user have
    to update this value depending on the used external PHY */
 #define PHY_SR    ((uint16_t)31) /* Value for DP83848 PHY */

 /* The Speed and Duplex mask values change from a PHY to another, so the user
    have to update this value depending on the used external PHY */
 #define PHY_DUPLEX_SPEED_STATUS_MASK  ((uint16_t)0x001C)
 #define PHY_100BTX_FULL               (18)
 #define PHY_100BTX_HALF								(8)
 #define PHY_10M_FULL									(14)
 #define PHY_10M_HALF									(4)


 #define PHY_READ_TO                     ((uint32_t)0x0004FFFF)
 #define PHY_WRITE_TO                    ((uint32_t)0x0004FFFF)

 #define PHY_BCR                          0          /*!< Transceiver Basic Control Register */
 #define PHY_BSR                          1          /*!< Transceiver Basic Status Register */

 #define PHY_RESET                       ((uint16_t)0x8000)      /*!< PHY Reset */
 #define PHY_Loopback                    ((uint16_t)0x4000)      /*!< Select loop-back mode */
 #define PHY_FULLDUPLEX_100M             ((uint16_t)0x2100)      /*!< Set the full-duplex mode at 100 Mb/s */
 #define PHY_HALFDUPLEX_100M             ((uint16_t)0x2000)      /*!< Set the half-duplex mode at 100 Mb/s */
 #define PHY_FULLDUPLEX_10M              ((uint16_t)0x0100)      /*!< Set the full-duplex mode at 10 Mb/s */
 #define PHY_HALFDUPLEX_10M              ((uint16_t)0x0000)      /*!< Set the half-duplex mode at 10 Mb/s */
 #define PHY_AUTONEGOTIATION             ((uint16_t)0x1000)      /*!< Enable auto-negotiation function */
 #define PHY_Restart_AutoNegotiation     ((uint16_t)0x0200)      /*!< Restart auto-negotiation function */
 #define PHY_Powerdown                   ((uint16_t)0x0800)      /*!< Select the power down mode */
 #define PHY_Isolate                     ((uint16_t)0x0400)      /*!< Isolate PHY from MII */

 #define PHY_AUTONEGO_COMPLETE           ((uint16_t)0x0020)      /*!< Auto-Negotiation process completed */
 #define PHY_LINKED_STATUS               ((uint16_t)0x0004)      /*!< Valid link established */
 #define PHY_Jabber_detection            ((uint16_t)0x0002)      /*!< Jabber condition detected */

 /* DP83848 PHY Address*/
 #define DP83848_PHY_ADDRESS             0x01U

 #define PHY_RESET_DELAY                 ((uint32_t)0x000002FFU)
 ///* PHY Configuration delay */
 #define PHY_CONFIG_DELAY                ((uint32_t)0x000003E8U)

 //#define PHY_READ_TO                     ((uint32_t)0x0000FFFFU)
 //#define PHY_WRITE_TO                    ((uint32_t)0x0000FFFFU)

 ///* Section 3: Common PHY Registers */

 //#define PHY_BCR                         ((uint16_t)0x0000U)  /*!< Transceiver Basic Control Register   */
 //#define PHY_BSR                         ((uint16_t)0x0001U)  /*!< Transceiver Basic Status Register    */
 //
 //#define PHY_RESET                       ((uint16_t)0x8000U)  /*!< PHY Reset */
 //#define PHY_LOOPBACK                    ((uint16_t)0x4000U)  /*!< Select loop-back mode */
 //#define PHY_FULLDUPLEX_100M             ((uint16_t)0x2100U)  /*!< Set the full-duplex mode at 100 Mb/s */
 //#define PHY_HALFDUPLEX_100M             ((uint16_t)0x2000U)  /*!< Set the half-duplex mode at 100 Mb/s */
 //#define PHY_FULLDUPLEX_10M              ((uint16_t)0x0100U)  /*!< Set the full-duplex mode at 10 Mb/s  */
 //#define PHY_HALFDUPLEX_10M              ((uint16_t)0x0000U)  /*!< Set the half-duplex mode at 10 Mb/s  */
 //#define PHY_AUTONEGOTIATION             ((uint16_t)0x1000U)  /*!< Enable auto-negotiation function     */
 //#define PHY_RESTART_AUTONEGOTIATION     ((uint16_t)0x0200U)  /*!< Restart auto-negotiation function    */
 //#define PHY_POWERDOWN                   ((uint16_t)0x0800U)  /*!< Select the power down mode           */
 //#define PHY_ISOLATE                     ((uint16_t)0x0400U)  /*!< Isolate PHY from MII                 */

 //#define PHY_AUTONEGO_COMPLETE           ((uint16_t)0x0020U)  /*!< Auto-Negotiation process completed   */
 //#define PHY_LINKED_STATUS               ((uint16_t)0x0004U)  /*!< Valid link established               */
 //#define PHY_JABBER_DETECTION            ((uint16_t)0x0002U)  /*!< Jabber condition detected            */
 //
 ///* Section 4: Extended PHY Registers */

 //#define PHY_SR                          ((uint16_t)0x0010U)  /*!< PHY status register Offset                      */

 //#define PHY_MICR                        ((uint16_t)0x0011U)  /*!< MII Interrupt Control Register                  */
 #define PHY_MISR                        ((uint16_t)0x0012U)  /*!< MII Interrupt Status and Misc. Control Register */
 //
 //#define PHY_LINK_STATUS                 ((uint16_t)0x0001U)  /*!< PHY Link mask                                   */
 //#define PHY_SPEED_STATUS                ((uint16_t)0x0002U)  /*!< PHY Speed mask                                  */
 //#define PHY_DUPLEX_STATUS               ((uint16_t)0x0004U)  /*!< PHY Duplex mask                                 */

 #define PHY_LINK_STATUS                 ((uint16_t)0x0001U)  /*!< PHY Link mask                                   */
 #define PHY_SPEED_STATUS                ((uint16_t)0x0004U)  /*!< PHY Speed mask                                  */
 #define PHY_DUPLEX_STATUS               ((uint16_t)0x0010U)  /*!< PHY Duplex mask                                 */

 //#define PHY_MICR_INT_EN                 ((uint16_t)0x0002U)  /*!< PHY Enable interrupts                           */
 //#define PHY_MICR_INT_OE                 ((uint16_t)0x0001U)  /*!< PHY Enable output interrupt events              */

 //#define PHY_MISR_LINK_INT_EN            ((uint16_t)0x0020U)  /*!< Enable Interrupt on change of link status       */
 #define PHY_LINK_INTERRUPT              ((uint16_t)0x2000U)  /*!< PHY link status interrupt mask                  */


/* ################## SPI peripheral configuration ########################## */

/* CRC FEATURE: Use to activate CRC feature inside HAL SPI Driver
* Activated: CRC code is present inside driver
* Deactivated: CRC code cleaned from driver
*/

#define USE_SPI_CRC                     1U

/* Includes ------------------------------------------------------------------*/
/**
  * @brief Include module's header file 
  */

#ifdef HAL_RCC_MODULE_ENABLED
  #include "stm32f4xx_hal_rcc.h"
#endif /* HAL_RCC_MODULE_ENABLED */

#ifdef HAL_GPIO_MODULE_ENABLED
  #include "stm32f4xx_hal_gpio.h"
#endif /* HAL_GPIO_MODULE_ENABLED */

#ifdef HAL_DMA_MODULE_ENABLED
  #include "stm32f4xx_hal_dma.h"
#endif /* HAL_DMA_MODULE_ENABLED */
   
